{
  "problems": [
    {
      "statement": "В калориметре смешивают две жидкости. Объём первой жидкости в полтора раза меньше объёма второй; плотность второй жидкости в 1,25 раза меньше плотности первой; удельная теплоёмкость второй жидкости составляет 2/3 удельной теплоёмкости первой, а температура первой жидкости, равная 25 °С, в 2,8 раза меньше, чем температура второй. Определите установившуюся температуру смеси. Потерями теплоты можно пренебречь.",
      "answer": {
        "type": "scale",
        "value": 45,
        "from": 30,
        "to": 60,
        "resolution": 1
      }
    }, {
      "statement": "Есть два тела, движущихся под действием силы 40 Н. Масса первого тела - 3 кг, а масса второго - 9 кг, коэффициент трения первого - 0.4, второго - 0.2, во сколько раз ускорение второго тела больше?",
      "answer": {
        "type": "scale",
        "value": 7,
        "from": 1,
        "to": 10,
        "resolution": 1
      }
    }, {
      "statement": "Произвели выстрел из пушки. Ядро вылетает параллельно горизонту со скоростью 16 м/с. Масса ядра - 3 кг, масса пушки - 27 кг. Расстояние от наччального положения пушки до края стены - 0.6 м. Ускорение от силы трения, действующей на пушку, равно 3.0625 м/с2. Упадёт ли пушка?",
      "answer": {
        "type": "radiobutton",
        "choices": ["Да", "Нет", "Неизвестно"],
        "value": "Нет"
      }
    }, {
      "statement": "Тело брошено под углом 60 градусов к горизонту со скоростью 10 м/с. Выберите правильную траекторию.",
      "image": "data/pic/task4.png",
      "answer": {
        "type": "radiobutton",
        "choices": ["Траектория 1", "Траектория 2", "Траектория 3"],
        "value": "Траектория 3"
      }
    }, {
      "statement": "Плавающий куб массой 7 г, площадь грани которого равна 1 см2 погружён в керосин (плотность 800 кг/м3). Ответ запишите в см2.",
      "answer": {
        "type": "scale",
        "value": 0.875,
        "from": 0.5,
        "to": 1,
        "resolution": 0.005,
        "delta": 0.01
      }
    },
    {
      "statement": "Нагревающая установка нагрела медный шарик объёмом 0.2 м3 на 18 градусов за час. Чему равна мощность установки? Потерями теплоты пренебречь (удельная теплоёмкость меди = 380, плотность = 8900). Ответ запишите в Вт",
      "answer": {
        "type": "entry",
        "value": "3382"
      }
    }, {
      "statement": "Вы находитесь в офисе и собираетесь включить ёлочную гирлянду. Однако вы замечаете, что ваш коллега зачем-то сунул палец в патрон, выкрутив одну из лампочек. Какой же странный тип. Безопасно ли включать при этом гирлянду? При включении на каждую из лампочек приходится напряжение 4 В. Общее напряжение - 220 В. Сила тока в гирлянде не более 2,5 А, а сопротивление пальца несколько сотен ом. Опасная для человека сила тока - 50 мА и больше. Состояние 0 рубильника - гирлянда выключена, состояние 1 - гирлянда включена.",
      "answer": {
        "type": "scale",
        "value": 0,
        "from": 0,
        "to": 1,
        "resolution": 1,
        "cursor": 0.5
      }
    }
  ]
}